[
  {
    "title": "Across the Wide Missouri (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOGQ4NTc5OGItMzM1MS00OWY1LTg5Y2UtZmMyYjMxMmNhN2M3XkEyXkFqcGc@._V1_.jpg",
    "description": "Across the Wide Missouri is a 1951 American Technicolor Western film directed by William A. Wellman and starring Clark Gable, Ricardo Montalbán, John Hodiak and James Whitmore. The screenplay is based on historian Bernard DeVoto's eponymous 1947 book and dramatizes an account of several fur traders and their interaction with the local Indians.",
    "year": "1951",
    "filmingLocations": "Durango, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0043262/"
  },
  {
    "title": "Anatomy of a Psycho",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYjJjYWFjN2MtNjdlOS00ZTQzLTkzMWItYTFiZmJmNjdlNjg0XkEyXkFqcGc@._V1_.jpg",
    "description": "Anatomy of a Psycho is a 1961 American crime thriller film directed by Boris Petroff. Ed Wood reportedly contributed to Jane Mann's screenplay as Larry Lee. Ronnie Burns, adopted son of George Burns and Gracie Allen, plays the romantic lead. The film was shot at the Alexander Film Company studios in Colorado Springs in 1959. It was the only feature film produced by the company. The film had the working title of Young Scarface; by the time film the film received a distributor it was retitled to exploit Anatomy of a Murder (1959) and Psycho (1960).",
    "year": "1961",
    "filmingLocations": "Colorado Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0054627/"
  },
  {
    "title": "Anticipation of the Night",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYWYwMmQ2NmUtYjAwMi00MjI5LTg5NDgtNTU5Mjk5MjlhYTBkXkEyXkFqcGc@._V1_.jpg",
    "description": "Anticipation of the Night is a 1958 American avant-garde film directed by Stan Brakhage. It was a breakthrough in the development of the lyrical style Brakhage used in his later films.",
    "year": "1958",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0213453/"
  },
  {
    "title": "Arizona Dream",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZTE2N2JiYjUtZTQzMS00YjFjLTg4M2QtNzlkYTE2ZTdlNTA5XkEyXkFqcGc@._V1_.jpg",
    "description": "Arizona Dream is a 1993 indie surrealist comedy drama film co-written and directed by Emir Kusturica and starring Johnny Depp, Jerry Lewis, Faye Dunaway, Lili Taylor and Vincent Gallo.",
    "year": "1993",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0106307/"
  },
  {
    "title": "The Art of Flight",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTkzZThlOTAtYzYyMy00NDczLTk4ZTUtNmVmZDcyOGY4MzUzXkEyXkFqcGc@._V1_.jpg",
    "description": "The Art of Flight is a Red Bull sponsored documentary film about snowboarding and a successor to That's It, That's All. Directed by Curt Morgan, it premiered in New York City on September 8, 2011, at the Beacon Theatre.",
    "year": "2011",
    "filmingLocations": "Aspen, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt1646967/"
  },
  {
    "title": "Aspen Extreme",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTQwZGZmZjktNTk0Yi00NDA4LWI1MmYtZTM3NGIwNTQxMTQ3XkEyXkFqcGc@._V1_.jpg",
    "description": "Aspen Extreme is a 1993 American drama film written and directed by Patrick Hasburgh. The plot is about two ski buddies, T.J. Burke and Dexter Rutecki, who move from Brighton, Michigan to Aspen, Colorado to seek a better life. The two friends quickly become Aspen ski instructors, but women, drugs, and job troubles threaten to destroy their relationship. Along the way, TJ tries to realize his dream of becoming a professional writer, and the pair train for the upcoming Powder 8 ski competition.",
    "year": "1993",
    "filmingLocations": "Aspen, Colorado, Buena Vista",
    "imdbUrl": "https://www.imdb.com/title/tt0106315/"
  },
  {
    "title": "The Aviation Cocktail",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTA5ODg1ODIxODFeQTJeQWpwZ15BbWU4MDU0NzgyNDAx._V1_.jpg",
    "description": "The Aviation Cocktail is a 2012 independent American drama film directed by David R. Higgins and starring Michael Haskins, Brandon Eaton, Beau Kiger, and Leah Lockhart. The plot is about the entangled lives of three World War II veterans living in the Midwestern United States in the 1950s. The film's title refers to a famous drink, the aviation.",
    "year": "2012",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt2124926/"
  },
  {
    "title": "Away We Go",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTYxNzE3NjAwMl5BMl5BanBnXkFtZTcwODkxOTI0Mg@@._V1_.jpg",
    "description": "Away We Go is a 2009 American romantic road comedy-drama film directed by Sam Mendes and written by Dave Eggers and Vendela Vida. The film's two leads are John Krasinski and Maya Rudolph. It is Mendes's first film without Thomas Newman's collaboration.",
    "year": "2009",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt1176740/"
  },
  {
    "title": "Badlands (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BN2U3ZjE1ZjUtYTRkMy00NTJiLTgyNzktMmE1OTUzYmRlOTUzXkEyXkFqcGc@._V1_.jpg",
    "description": "Badlands is a 1973 American neo-noir period crime drama film written, produced and directed by Terrence Malick, in his directorial debut. The film stars Martin Sheen and Sissy Spacek, and follows Holly Sargis (Spacek), a 15-year old who goes on a killing spree with her partner, Kit Carruthers (Sheen). The film also stars Warren Oates and Ramon Bieri. While the story is fictional, it is loosely based on the real-life murder spree of Charles Starkweather and his girlfriend, Caril Ann Fugate, in 1958.",
    "year": "1973",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0069762/?ref_=nv_sr_srsg_3_tt_8_nm_0_in_0_q_badlands"
  },
  {
    "title": "The Ballad of Buster Scruggs",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTc0MzZjYTktYzBlZC00MmViLTgyNDYtNjljNTcxMzdjODRkXkEyXkFqcGc@._V1_.jpg",
    "description": "The Ballad of Buster Scruggs is a 2018 American Western black comedy anthology film written, directed, produced, and edited by the Coen brothers. It stars Tim Blake Nelson, Tyne Daly, James Franco, Brendan Gleeson, Bill Heck, Grainger Hines, Zoe Kazan, Harry Melling, Liam Neeson, Jonjo O'Neill, Chelcie Ross, Saul Rubinek, and Tom Waits. It consists of six vignettes set on the American frontier.",
    "year": "2018",
    "filmingLocations": "Telluride, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt6412452/"
  },
  {
    "title": "Barquero",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNWFiYWZkOTgtODZlNS00N2RjLWIzNTItYWY3ZTc3MWM1YzNiXkEyXkFqcGc@._V1_.jpg",
    "description": "Barquero is a 1970 American Western film starring Lee Van Cleef and Warren Oates, produced by Hal Klein and directed by Gordon Douglas.",
    "year": "1970",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0065451/"
  },
  {
    "title": "Big Bad John (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZjQ5ZmIzMTYtZjJiNy00MGIxLThlMWEtODI4MDBmOWY5MzhkXkEyXkFqcGc@._V1_.jpg",
    "description": "Big Bad John is a 1990 American Western film directed by Burt Kennedy. It stars Ned Beatty and Jimmy Dean, the latter of whom wrote and performed the song the film is based upon.",
    "year": "1990",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0099134/"
  },
  {
    "title": "Bigger Than Us (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BN2FlZmQxOWMtNjg0Zi00YTUyLWE1YzAtY2FiNjM1Y2I1MDJkXkEyXkFqcGc@._V1_.jpg",
    "description": "Bigger Than Us is a 2021 French documentary film produced and directed by Flore Vasseur, co-produced by Marion Cotillard, and written by Vasseur and Melati Wijsen. The film made its world premiere at the 2021 Cannes Film Festival in the special section Cinema for the Climate on 10 July 2021. It was released theatrically in France by Jour2fête on 22 September 2021. It was nominated for the César Award for Best Documentary Film in 2022.",
    "year": "2021",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt10150684/"
  },
  {
    "title": "Bill, the Galactic Hero (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjE2Mjg5MzU5M15BMl5BanBnXkFtZTgwODMzMzYzNTE@._V1_.jpg",
    "description": "Bill, the Galactic Hero is a 2014 science fiction student film directed by Alex Cox and six student co-directors based on Harry Harrison's 1965 novel of the same name.",
    "year": "2014",
    "filmingLocations": "Denver, Boulder, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt4294218/"
  },
  {
    "title": "Bite the Bullet (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZjZjMzUwNDItMTdlZS00N2Y0LTgyZTYtZGIxMDE0MmRjZGE4XkEyXkFqcGc@._V1_.jpg",
    "description": "Bite the Bullet is a 1975 American Western film written, produced, and directed by Richard Brooks and starring Gene Hackman, Candice Bergen, and James Coburn, with Ian Bannen, Jan-Michael Vincent, Ben Johnson and Dabney Coleman in supporting roles.",
    "year": "1975",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0072705/"
  },
  {
    "title": "Broken Roads (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjY5NzYxOTY4OF5BMl5BanBnXkFtZTcwMjk4ODU3OA@@._V1_.jpg",
    "description": "Broken Roads is a 2012 American family drama film written, directed and produced by Justin Chambers alongside producer William Alexander IV and producer/editor Karina Diaz, and starring Sally Kirkland as Wallace Russo and Aidan Bristow as Aldo Russo.",
    "year": "2012",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt1945052/"
  },
  {
    "title": "Butch Cassidy and the Sundance Kid",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTkyMTM2NDk5Nl5BMl5BanBnXkFtZTgwNzY1NzEyMDE@._V1_.jpg",
    "description": "Butch Cassidy and the Sundance Kid is a 1969 American Western buddy film directed by George Roy Hill and written by William Goldman. Based loosely on fact, the film tells the story of Wild West outlaws Robert LeRoy Parker, known as Butch Cassidy, and his partner Harry Longabaugh, the \"Sundance Kid\", who are on the run from a crack US posse after a string of train robberies. The pair and Sundance's lover, Etta Place, flee to Bolivia to escape the posse.",
    "year": "1969",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0064115/"
  },
  {
    "title": "Cannibal! The Musical",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYTBiYTA5MTEtMGE5OC00NDFjLThjZTktYjAxOTAzYmZiNWU1XkEyXkFqcGc@._V1_.jpg",
    "description": "The sole survivor of an ill-fated mining expedition tells how his taste for gold was replaced by that of human flesh.",
    "year": "1993",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0115819/"
  },
  {
    "title": "Cat Ballou",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNjI2OTRjNWItMmMyYi00ZDVlLWFkY2ItZjdjNWI5NzE3NGQyXkEyXkFqcGc@._V1_.jpg",
    "description": "Cat Ballou is a 1965 American western comedy film starring Jane Fonda and Lee Marvin, who won an Academy Award for his dual role. The story involves a woman who hires a notorious gunman to protect her father's ranch, and later to avenge his murder, only to find that the gunman is not what she expected. The supporting cast features Tom Nardini, Michael Callan, Dwayne Hickman, and Nat King Cole and Stubby Kaye, who together perform the film's theme song, and who appear throughout the film in the form of travelling minstrels or troubadours as a kind of musical Greek chorus and framing device.",
    "year": "1965",
    "filmingLocations": "Denver, Colorado Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0059017/"
  },
  {
    "title": "Catch and Release (2006 film)",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/thumb/8/87/Catch_and_releaseposter.jpg/220px-Catch_and_releaseposter.jpg",
    "description": "Catch and Release is a 2006 American romantic comedy film written and directed by Susannah Grant, her first film as director, and starring Jennifer Garner, Timothy Olyphant, Kevin Smith, Sam Jaeger and Juliette Lewis.",
    "year": "2006",
    "filmingLocations": "Denver, Boulder, Colorado",
    "imdbUrl": "https://www.imdb.com/find?q=Catch%20and%20Release&s=tt&exact=true"
  },
  {
    "title": "Christo's Valley Curtain",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjAzNDA5MTc1Nl5BMl5BanBnXkFtZTcwMDA0MzUyMQ@@._V1_.jpg",
    "description": "Christo's Valley Curtain is a 1974 American short documentary film directed by Albert and David Maysles, about Christo and Jeanne-Claude's Valley Curtain project.",
    "year": "1974",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0069877/"
  },
  {
    "title": "Cliffhanger (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNGJkZmZlYTYtODQ1ZC00N2JiLWIxMWYtZTE4ZDMxZjQyZTAzXkEyXkFqcGc@._V1_.jpg",
    "description": "A cliffhanger is a plot device as an ending of a fictional work.",
    "year": null,
    "filmingLocations": "Colorado, Glenwood Springs",
    "imdbUrl": "https://www.imdb.com/title/tt0106582/?ref_=nv_sr_srsg_1_tt_7_nm_1_in_0_q_cliffhanger"
  },
  {
    "title": "Climb Dance",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMWJiOWU4MzUtMTE4Ny00OGY1LWFiZWMtYTAwMDg5MGI5NDg0XkEyXkFqcGc@._V1_.jpg",
    "description": "Climb Dance is a cinéma vérité short film, which features Finnish rally driver Ari Vatanen setting a record time in the highly modified four-wheel drive, all-wheel steering Peugeot 405 Turbo 16 at the 1988 Pikes Peak International Hillclimb in Colorado, United States. The film was produced by Peugeot and directed by Jean Louis Mourey. The record time set was 10:47.77.",
    "year": "1988",
    "filmingLocations": "Pikes Peak, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt2217767/"
  },
  {
    "title": "Colorado C.I.",
    "imageUrl": "https://m.media-amazon.com/images/G/01/imdb/images/social/imdb_logo.png",
    "description": "Colorado C.I. is a 1978 American made-for-television crime drama mystery film and was intended as a pilot for a series. The teleplay was written by Robert W. Lenski and the film directed by Virgil W. Vogel, with Christopher Morgan as the producer and Philip Saltzman as the Executive Producer. The film was broadcast on CBS on May 26, 1978.",
    "year": "1978",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0215636/"
  },
  {
    "title": "Colorado Territory (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjgyYTgwYmQtNGE2OC00M2E1LWFlMjgtMjk4NGRlNmEwOGEyXkEyXkFqcGc@._V1_.jpg",
    "description": "Colorado Territory is a 1949 American Western \nfilm noir directed by Raoul Walsh and starring Joel McCrea, Virginia Mayo, and Dorothy Malone. Written by Edmund H. North and John Twist, and based on the novel High Sierra by W.R. Burnett, the film is about outlaw Wes McQueen who is sprung from jail to help pull one last railroad job.",
    "year": "1949",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0041253/"
  },
  {
    "title": "Continental Divide (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTRjOWZiNTMtZDY0MS00NjZiLWIxNDctMDQ3NGM1NDA1Yjk5XkEyXkFqcGc@._V1_.jpg",
    "description": "Continental Divide is a 1981 American romantic comedy-drama film starring John Belushi and Blair Brown. It was the first film to be credited as being produced by Steven Spielberg's production company Amblin Entertainment. It was directed by Michael Apted and written by Lawrence Kasdan.",
    "year": "1981",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0082200/"
  },
  {
    "title": "Cop Car (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTMyMDc5OTUwMl5BMl5BanBnXkFtZTgwMjEwNjc3NTE@._V1_.jpg",
    "description": "Cop Car is a 2015 American independent road-thriller film co-written and directed by Jon Watts and starring Kevin Bacon, Shea Whigham, Camryn Manheim, James Freedson-Jackson, and Hays Wellford. The film follows two young boys and juvenile delinquents who come across and hijack the abandoned police car of a corrupt sheriff. It premiered at the 2015 Sundance Film Festival and was released in the United States on August 7, 2015 by Focus World. The film received mainly positive reviews from critics but was commercially unsuccessful, earning $143,658 on a $5 million budget.",
    "year": "2015",
    "filmingLocations": "Colorado Springs, Fountain",
    "imdbUrl": "https://www.imdb.com/title/tt3813310/"
  },
  {
    "title": "The Cowboys",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNzMzODYyMTktOWE3Yy00ODM3LWI5MDctNzEzOTllMDQ3YTRiXkEyXkFqcGc@._V1_.jpg",
    "description": "The Cowboys is a 1972 American Western film starring John Wayne, Roscoe Lee Browne, and Bruce Dern, and featuring Colleen Dewhurst and Slim Pickens. It was the feature film debut of Robert Carradine. Based on the 1971 novel of the same name by William Dale Jennings, the screenplay was written by Irving Ravetch, Harriet Frank Jr., and Jennings and was directed by Mark Rydell.",
    "year": "1972",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0068421/"
  },
  {
    "title": "Dangerous Love (1920 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjA3NGQ4Y2EtNTA0NC00YmViLWJkMTctY2MwOGUyYWNiYTEwXkEyXkFqcGc@._V1_.jpg",
    "description": "Dangerous Love is a 1920 American silent Western film based on the 1917 novel Ben Warman by Charles E. Winter, who would later become a congressman for Wyoming. The film was directed by Charles Bartlett, and stars Pete Morrison, Carol Holloway, Ruth King, Jack Richardson, and Spottiswoode Aitken. The movie was shot at the Lakeside Studios in Denver, Colorado. The feature had previously been announced under several titles before its release, including The Vanishing Strain, Ben Warman, A Good Bad Man, and Broken Promises.",
    "year": "1920",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0150268/?ref_=ttpl_ov_bk"
  },
  {
    "title": "Dear Eleanor",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BY2EwYTc4OGYtM2U4OS00NTA0LTg1YjctZTdlYzIwODQwNDYwXkEyXkFqcGc@._V1_.jpg",
    "description": "Dear Eleanor is a 2016 American film, directed by Kevin Connolly, and starring Isabelle Fuhrman, Josh Lucas, Liana Liberato, and Jessica Alba. Written by Cecilia Contreras and Amy Garcia, it is a coming of age story about two best friends traveling across the U.S. in 1962 to meet their childhood hero, Eleanor Roosevelt.",
    "year": "2016",
    "filmingLocations": "Denver, Boulder, Longmont, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt2927212/"
  },
  {
    "title": "Decampitated",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTY4NzAzNTYyNF5BMl5BanBnXkFtZTcwMDkzMTgyMQ@@._V1_.jpg",
    "description": "Decampitated is a 1998 independent American horror comedy film. It was directed by Matt Cunningham and stars Mike Hart, Jonathon Scott, Thomas Martwick, Steve Ladden, and Cristina Patterson Ceret. It was given a limited release in theaters and distributed on video by Troma Entertainment. Decampitated was filmed in Colorado, and finishing funds were provided by Troma Entertainment.",
    "year": "1998",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0118951/"
  },
  {
    "title": "Denver and Rio Grande (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjA5NDk1Mjk0M15BMl5BanBnXkFtZTcwNDQzODgxMQ@@._V1_.jpg",
    "description": "Denver and Rio Grande is a 1952 American Technicolor Western film, directed by Byron Haskin and released by Paramount Pictures. The film is a dramatization of the building of the eponymous railroad, which was chartered in 1870. It was filmed in the summer of 1951 on location on actual D&RG track near Durango, Colorado.",
    "year": "1952",
    "filmingLocations": "Denver, Durango, Pueblo, Colorado, Silverton, Leadville",
    "imdbUrl": "https://www.imdb.com/title/tt0044537/"
  },
  {
    "title": "The Desert Scorpion",
    "imageUrl": "https://alchetron.com/cdn/the-desert-scorpion-b8178c56-7d69-4d7f-b641-88f6b7f708d-resize-750.jpg",
    "description": "The Desert Scorpion is a 1920 American silent Western film directed by Otis B. Thayer and starring Edmund Cobb and Vida Johnson. The film was shot in Denver, Colorado by the Thayer's Art-O-Graf film company.",
    "year": "1920",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0191079/"
  },
  {
    "title": "Detective Pikachu (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNDU4Mzc3NzE5NV5BMl5BanBnXkFtZTgwMzE1NzI1NzM@._V1_.jpg",
    "description": "Pokémon Detective Pikachu is a 2019 fantasy film and the first live-action film based on the Pokémon franchise. It is a loose adaptation of the 2016 video game Detective Pikachu. Directed by Rob Letterman and written by Letterman, Dan Hernandez, Benji Samit, and Derek Connolly, the film stars Ryan Reynolds as the voice and motion capture of Pikachu, with Justice Smith, Kathryn Newton, Suki Waterhouse, Omar Chaparro, Chris Geere, Ken Watanabe and Bill Nighy in live-action roles. The plot follows Detective Pikachu and his partner Tim Goodman as they attempt to solve the mysterious disappearance of Tim's father, Harry. Filming took place from January to May 2018 in Colorado, England, and Scotland.",
    "year": "2019",
    "filmingLocations": "Denver, Colorado Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt5884052/"
  },
  {
    "title": "Devil's Doorway",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOWIxOWVkZjEtZWIyYy00NWNlLWFjYjQtYWFiYWQwYTFiMWYyXkEyXkFqcGc@._V1_.jpg",
    "description": "Devil's Doorway is a 1950 American MGM Western film directed by Anthony Mann and starring Robert Taylor, Louis Calhern and Paula Raymond. The plot concerns the bigotry faced by an American Indian war veteran in his hometown.",
    "year": "1950",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0042395/"
  },
  {
    "title": "Die Hard 2",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTA1OGFlZWUtZjE4Yy00MzFmLTlhYjctOGY5ZmZjOWFlOWUwXkEyXkFqcGc@._V1_.jpg",
    "description": "Die Hard 2 is a 1990 American action film directed by Renny Harlin, written by Steven E. de Souza and Doug Richardson, co-produced by Joel Silver, and starring Bruce Willis as John McClane alongside Bonnie Bedelia, William Sadler, Art Evans, William Atherton, Franco Nero, Dennis Franz, Fred Thompson, John Amos, and Reginald VelJohnson. The sequel to Die Hard (1988) and the second installment in the Die Hard film series, the film was released on July 4, 1990 by 20th Century Fox, in the United States.",
    "year": "1990",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt0099423/"
  },
  {
    "title": "Downhill Racer",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYjhhOWQ5NDYtM2I2Ni00NWNjLWExOWYtM2MzMmNlOGVhMTAyXkEyXkFqcGc@._V1_.jpg",
    "description": "Downhill Racer is a 1969 American sports drama film starring Robert Redford, Gene Hackman, and Camilla Sparv; it was the directorial debut of Michael Ritchie. Written by James Salter, based on Oakley Hall's 1963 novel The Downhill Racers, the film is about talented American downhill racer David Chappellet, who joins the U.S. Ski Team in Europe to compete in international skiing competitions.",
    "year": "1969",
    "filmingLocations": "Denver, Boulder, Steamboat Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0064253/"
  },
  {
    "title": "The Duchess and the Dirtwater Fox",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNWMxZDA5NGQtODBjZi00ODIyLWJlZjItNGJjZTZiMzVmODc4XkEyXkFqcGc@._V1_.jpg",
    "description": "The Duchess and the Dirtwater Fox is a 1976 American Western romantic comedy film directed and produced by Melvin Frank from a screenplay by Frank, Barry Sandler, and Jack Rose and a story by Sandler. It stars George Segal and Goldie Hawn as the title characters. It follows a female hustler who becomes repeatedly mixed up with a suave con man and card sharp through a series of misadventures before falling in love with him.",
    "year": "1976",
    "filmingLocations": "Denver, Colorado, Central City",
    "imdbUrl": "https://www.imdb.com/title/tt0074441/"
  },
  {
    "title": "Dumb and Dumber",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNGQxZDA1MmMtYWQ1Ni00NTJmLTljMjgtZWVmODllODVhMzgyXkEyXkFqcGc@._V1_.jpg",
    "description": "Dumb and Dumber is a 1994 American road buddy comedy film directed by Peter Farrelly, who cowrote the screenplay with his brother Bobby and Bennett Yellin. It is the first installment in the Dumb and Dumber franchise. Starring Jim Carrey and Jeff Daniels, it tells the story of Lloyd Christmas (Carrey) and Harry Dunne (Daniels), two dumb but well-meaning friends from Providence, Rhode Island, who set out on a cross-country road trip to Aspen, Colorado, to return a briefcase full of money to its owner, thinking it was abandoned as a mistake, though it was actually left as a ransom. Lauren Holly, Karen Duffy, Mike Starr, Charles Rocket, and Teri Garr play supporting roles.",
    "year": "1994",
    "filmingLocations": "Denver, Aspen, Breckenridge, Estes Park, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0109686/"
  },
  {
    "title": "Elevation (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BY2NiNDM0NWYtNzQxNi00NmY1LTg1YmYtMDE5ZmQzMGJlMGQzXkEyXkFqcGc@._V1_.jpg",
    "description": "Elevation is a 2024 American post-apocalyptic action thriller film directed by George Nolfi and written by Kenny Ryan and Jacob Roman. It stars Anthony Mackie, Morena Baccarin, and Maddie Hasson.",
    "year": "2024",
    "filmingLocations": "Boulder, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt23558280/"
  },
  {
    "title": "Elves (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTI4OGJlMDctMjRlNi00YjhlLWI2YjgtOGMyYzJkMWJjYmRkXkEyXkFqcGc@._V1_.jpg",
    "description": "Elves is a 1989 American Christmas horror film directed by Jeffrey Mandel and starring Dan Haggerty, Deanna Lund, and Ken Carpenter.",
    "year": "1989",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt13231962/"
  },
  {
    "title": "Endangered Species (1982 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZjU1MTY4NWUtNjAwYS00NTViLWJjNjItNTFhNjg4NjUyMmY4XkEyXkFqcGc@._V1_.jpg",
    "description": "Endangered Species is a 1982 American science fiction horror film directed and co-written by Alan Rudolph, and starring Robert Urich, JoBeth Williams, Peter Coyote, and Hoyt Axton. It follows a former New York City police officer (Urich) who relocates to a rural Colorado town, where a newly appointed sheriff (Williams) is investigating a series of bizarre cattle mutilations.",
    "year": "1982",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt5539466/"
  },
  {
    "title": "Even Hitler Had a Girlfriend",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTcxNDIyMzIxNV5BMl5BanBnXkFtZTgwNTU4OTQwMTE@._V1_.jpg",
    "description": "Even Hitler Had a Girlfriend is a 1991 black comedy film about a lonely security guard who spends his life savings on call girls in less than two weeks. It was directed by artist/filmmaker Ronnie Cramer and is based on a story by T. G. Baker. Shot in Denver, Colorado, Omaha, Nebraska and at Mount Rushmore in South Dakota, Even Hitler is celebrated in cult film circles for its extremely dark sense of humor and its copious amount of female nudity.",
    "year": "1991",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0104212/"
  },
  {
    "title": "Every Which Way but Loose",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDc3NGNjYjctZTVjZi00YTQ2LTgxMGMtMjBjYTVhZWE1OTk5XkEyXkFqcGc@._V1_.jpg",
    "description": "Every Which Way but Loose is a 1978 American action comedy film released by Warner Bros. starring Clint Eastwood in an uncharacteristic and offbeat comedy role. It was produced by Robert Daley and directed by James Fargo. Eastwood plays Philo Beddoe, a trucker and bare-knuckle brawler roaming the American West in search of a lost love while accompanied by his brother/manager Orville and his pet orangutan Clyde. Philo encounters a wide assortment of characters, including a pair of police officers and a motorcycle gang who pursue him for revenge.",
    "year": "1978",
    "filmingLocations": "Denver, Aurora, Colorado, Georgetown",
    "imdbUrl": "https://www.imdb.com/title/tt0077523/"
  },
  {
    "title": "Everybody's All-American (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BY2M3NDhmN2QtNTEwOS00NjI1LTg1ZjMtMmEwNzA1MzhkMjYwXkEyXkFqcGc@._V1_.jpg",
    "description": "Everybody's All-American is a 1988 American sports drama film, released internationally as When I Fall in Love, directed by Taylor Hackford and based on the 1981 novel Everybody's All-American by longtime Sports Illustrated contributor Frank Deford.",
    "year": "1988",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0095119/"
  },
  {
    "title": "Fast Food Nation (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDljZTAzYjYtYWQwMi00NzE2LWI4ZjAtMTQ2OTRhZDI0NjI2XkEyXkFqcGc@._V1_.jpg",
    "description": "Fast Food Nation is a 2006 mockumentary political satire black comedy film directed by Richard Linklater and written by Linklater and Eric Schlosser. The film, an international co-production of the United States and the United Kingdom, is loosely based on Schlosser's 2001 non-fiction book.",
    "year": "2006",
    "filmingLocations": "Colorado Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0460792/"
  },
  {
    "title": "Fidaa",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYTZjYjhlZTMtYzg1OC00OWYwLThhNGEtY2M2MmNjM2FmMzhiXkEyXkFqcGc@._V1_.jpg",
    "description": "Fidaa (transl. Spellbound) is a 2017 Indian Telugu-language romantic drama film written and directed by Sekhar Kammula, and produced by Dil Raju under Sri Venkateswara Creations banner. The film stars Sai Pallavi and Varun Tej in the lead roles. The film marks Sai Pallavi's debut in Telugu cinema. The plot follows Varun, an NRI, and Bhanu, a spirited village girl, as their budding romance faces cultural clashes and personal challenges. After parting ways, destiny reunites them, testing their love and resilience in unexpected ways.",
    "year": "2017",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt7159382/"
  },
  {
    "title": "Finders Keepers (1921 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYWU4OTY4MDctNjEzZS00NzY5LTg0ZGMtZTY5MWY5YmEzNTllXkEyXkFqcGc@._V1_.jpg",
    "description": "Finders Keepers is a 1921 silent Western film based on a book by Robert Ames Bennett and directed by Otis B. Thayer, starring Edmund Cobb and Violet Mersereau. The film was shot in Denver, Colorado by the Thayer's Art-O-Graf film company. The film is now considered a lost film.",
    "year": "1921",
    "filmingLocations": "Denver, Pikes Peak, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt27656056/"
  },
  {
    "title": "For Love of the Game (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNjA5ZDZkMTctYmVhOC00ZDQzLWE3MTctNWIyZmRhOGZhMDM4XkEyXkFqcGc@._V1_.jpg",
    "description": "For Love of the Game is a 1999 American sports drama film directed by Sam Raimi and written by Dana Stevens, based on Michael Shaara's 1991 novel of the same title. Starring Kevin Costner and Kelly Preston, it follows the perfect game performance of an aging star baseball pitcher as he deals with the pressures of pitching in Yankee Stadium in his final outing by calming himself with memories of a long-term relationship.",
    "year": "1999",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0126916/"
  },
  {
    "title": "The Frame (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTYzODgzODA1NF5BMl5BanBnXkFtZTgwNDc5ODk2OTE@._V1_.jpg",
    "description": "The Frame is a 2014 American science fiction film, written and directed by Jamin Winans and starring David Carranza and Tiffany Mualem. It was produced by Winans's own independent production company, Double Edge Films, with Kiowa K. Winans, and shot by cinematographer Robert Muratore in locations around Denver, Colorado. It is the follow-up to the 2009 science fiction fantasy film Ink, also written and directed by Jamin Winans. The Frame played at the 2015 Sitges Film Festival in Spain, the 2015 Imagine Film Festival in Amsterdam and the 2015 Fantaspoa Film Festival in Brazil.",
    "year": "2014",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt2567038/"
  },
  {
    "title": "The Frankenstein Brothers",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/7/7d/The_Frankenstein_Brothers.jpg",
    "description": "The Frankenstein Brothers is a 2010 independent romantic comedy that takes place in Longmont, Colorado. The plot is centered on two orphan brothers, recently graduated from college, who inherit the Left Hand Brewing Company.",
    "year": "2010",
    "filmingLocations": "Denver, Longmont, Colorado",
    "imdbUrl": "https://www.imdb.com/find?q=The%20Frankenstein%20Brothers&s=tt&exact=true"
  },
  {
    "title": "A French Gigolo",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYTIzOGMzNjEtNjQ2ZS00M2ZmLWI2OGUtODZlMzA0MmU3MGI5XkEyXkFqcGc@._V1_.jpg",
    "description": "A French Gigolo is a 2008 French comedy-drama film directed by Josiane Balasko and starring Nathalie Baye, Éric Caravaca, Isabelle Carré and Balasko.",
    "year": "2008",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt1091992/"
  },
  {
    "title": "Furious 7",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTQxOTA2NDUzOV5BMl5BanBnXkFtZTgwNzY2MTMxMzE@._V1_.jpg",
    "description": "Furious 7 is a 2015 action film directed by James Wan and written by Chris Morgan. It is the sequel to Fast & Furious 6 (2013), a follow-up to The Fast and the Furious: Tokyo Drift (2006), and the seventh installment in the Fast & Furious franchise. The film stars an ensemble cast including Vin Diesel, Paul Walker, Dwayne Johnson, Michelle Rodriguez, Tyrese Gibson, Ludacris, Jordana Brewster, Djimon Hounsou, Kurt Russell and Jason Statham. In the film, Dominic Toretto, Brian O'Conner and their team are recruited by covert ops leader Mr. Nobody to prevent Mose Jakande (Hounsou), a terrorist, from obtaining a hacking program known as God's Eye, all while being hunted by Deckard Shaw, the brother of Owen Shaw.",
    "year": "2015",
    "filmingLocations": "Pikes Peak, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt2820852/"
  },
  {
    "title": "The Further Adventures of the Wilderness Family",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMzMwMzFiMjAtNTRiZC00YzZkLTk4ZWQtYjM0MTRlZmU5N2E5XkEyXkFqcGc@._V1_.jpg",
    "description": "The Further Adventures of the Wilderness Family is a 1978 adventure/family movie that stars Robert Logan, George Buck Flower, and Susan Damante-Shaw and is a sequel to The Adventures of the Wilderness Family. In this sequel to the first movie, Heather Rattray now plays the role of Jenny.",
    "year": "1978",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0077587/"
  },
  {
    "title": "Geostorm",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTA0OTQwMTIxNzheQTJeQWpwZ15BbWU4MDQ1MzI3OTMy._V1_.jpg",
    "description": "Geostorm is a 2017 American science-fiction disaster film directed, cowritten, and coproduced by Dean Devlin. The film stars Gerard Butler, Jim Sturgess, Abbie Cornish, Ed Harris, and Andy García. It follows a satellite designer who tries to save the world from a storm of epic proportions caused by malfunctioning climate-controlling satellites.",
    "year": "2017",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt1981128/"
  },
  {
    "title": "The Gold Rush",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNGU1NjYzYTAtZmY0YS00NWIzLTkzNzUtYzc2ZTIyOTIxZjVhXkEyXkFqcGc@._V1_.jpg",
    "description": "The Gold Rush is a 1925 American silent comedy film written, produced, and directed by Charlie Chaplin. The film also stars Chaplin in his Little Tramp persona, Georgia Hale, Mack Swain, Tom Murray, Henry Bergman and Malcolm Waite.",
    "year": "1925",
    "filmingLocations": "Centennial",
    "imdbUrl": "https://www.imdb.com/title/tt0015864/"
  },
  {
    "title": "The Great K & A Train Robbery",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTk4OTMyMzMxNl5BMl5BanBnXkFtZTgwMjM3Njk5MTE@._V1_.jpg",
    "description": "The Great K & A Train Robbery is a 1926 American silent Western film directed by Lewis Seiler and starring Tom Mix and Dorothy Dwan. The film is based on the actual foiling of a train robbery by Dick Gordon as related by Paul Leicester Ford in his book The Great K & A Train Robbery originally published as a serial in Lippincott's Monthly Magazine in 1896.",
    "year": "1926",
    "filmingLocations": "Boulder, Colorado, Glenwood Springs",
    "imdbUrl": "https://www.imdb.com/title/tt0016939/"
  },
  {
    "title": "Hacking at Leaves",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BM2E3YzcwYWUtMTM4Yi00MWI1LTkxM2YtZjIzMDYwOWMyZjc4XkEyXkFqcGc@._V1_.jpg",
    "description": "Hacking at Leaves is a 2024 Austrian documentary film directed and written by Johannes Grenzfurthner. It explores various themes including the United States' colonial past, Navajo tribal history, and the hacker movement, through the lens of the story of a hackerspace in Durango, Colorado, during the early phase of the COVID-19 pandemic. The film was produced by monochrom.",
    "year": "2024",
    "filmingLocations": "Durango, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt14493924/"
  },
  {
    "title": "The Hateful Eight",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjA1MTc1NTg5NV5BMl5BanBnXkFtZTgwOTM2MDEzNzE@._V1_.jpg",
    "description": "The Hateful Eight is a 2015 American Western mystery thriller film written and directed by Quentin Tarantino. It stars Samuel L. Jackson, Kurt Russell, Jennifer Jason Leigh, Walton Goggins, Demián Bichir, Tim Roth, Michael Madsen, and Bruce Dern as eight dubious strangers who seek refuge from a blizzard in a stagecoach stopover a decade after the American Civil War.",
    "year": "2015",
    "filmingLocations": "Denver, Telluride, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt3460252/"
  },
  {
    "title": "Ice Castles",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOGFlMWZkYTUtOTVlMS00NTU3LWJlYjgtYTk2OGJlMTc3N2E0XkEyXkFqcGc@._V1_.jpg",
    "description": "Ice Castles is a 1978 American romantic drama film directed by Donald Wrye and starring Lynn-Holly Johnson and Robby Benson. It is the story of Lexie Winston, a young figure skater, and her rise and fall from super stardom. Tragedy strikes when, following a freak accident, Lexie loses her sight, leaving her to hide away in the privacy of her own despair. She eventually perseveres and begins competing in figure skating again.",
    "year": "1978",
    "filmingLocations": "Colorado Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0077716/"
  },
  {
    "title": "Identity Thief",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTY3NzM5MTk2Nl5BMl5BanBnXkFtZTcwMDQ4MjQ3OA@@._V1_.jpg",
    "description": "Identity Thief is a 2013 American road comedy film directed by Seth Gordon, written by Craig Mazin from a story by Mazin and Jerry Eeten. It stars Jason Bateman, Melissa McCarthy, Jon Favreau, Amanda Peet, Tip 'T.I.' Harris, Genesis Rodriguez, Morris Chestnut, John Cho, Robert Patrick, and Eric Stonestreet.",
    "year": "2013",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt2024432/"
  },
  {
    "title": "Indiana Jones and the Last Crusade",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNGIxNzQ0YzYtMjNmYi00YjBlLWFjNzEtNGE3ZGFmYTczM2MwXkEyXkFqcGc@._V1_.jpg",
    "description": "Indiana Jones and the Last Crusade is a 1989 American action-adventure film directed by Steven Spielberg from a screenplay by Jeffrey Boam, based on a story by George Lucas and Menno Meyjes. It is the third installment in the Indiana Jones film series and the narrative sequel to Raiders of the Lost Ark (1981). Harrison Ford reprises his role as the titular character, while Sean Connery co-stars as his father. Other cast members featured include Alison Doody, Denholm Elliott, Julian Glover, River Phoenix and John Rhys-Davies. In the film, set in 1938, Indiana Jones searches for his father, a Holy Grail scholar, who has been kidnapped and held hostage by the Nazis while on a journey to find the Holy Grail.",
    "year": "1989",
    "filmingLocations": "Boulder, Mesa Verde, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0097576/"
  },
  {
    "title": "Ink (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNDlmM2ZmNTMtYjBkZS00MmMxLWEzMzQtNDUzMWQ4OTQ1NzNiXkEyXkFqcGc@._V1_.jpg",
    "description": "John Sullivan (Chris Kelly), in a hurry to get into his car. He appears to be severely stressed as he begins driving down the city streets. When he goes through a lighted intersection he is broadsided by another driver that is distracted by hot coffee in his lap. As he becomes unconscious, he dreams of playing with his young daughter, Emma (Quinn Hunchar). Emma pretends to be kidnapped and tells John to save her from the monsters, although John seems exasperated and tells her to have her mother do it instead. Eventually, however, John gives in and runs to save his daughter, while Emma laughs and embraces him.",
    "year": 2009,
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt37967547/"
  },
  {
    "title": "Lightning Jack",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMWJiNGE2ZTctN2I3YS00YmE2LWE4ZWItNDM0NDAzYzI1Y2NkXkEyXkFqcGc@._V1_.jpg",
    "description": "Lightning Jack is a 1994 Western comedy film written by and starring Paul Hogan, as well as Cuba Gooding Jr. and Beverly D'Angelo.",
    "year": "1994",
    "filmingLocations": "Colorado, Buena Vista",
    "imdbUrl": "https://www.imdb.com/title/tt0110353/"
  },
  {
    "title": "The Lone Ranger (2013 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYjQ1YWE5NzktOWYyYS00MTBmLWE1NDUtMTU5Mzc2YWQyNzhjXkEyXkFqcGc@._V1_.jpg",
    "description": "The Lone Ranger is a 2013 American Western action film directed by Gore Verbinski and written by Justin Haythe, Ted Elliott and Terry Rossio. Based on the title character of the same name, the film stars Johnny Depp as Tonto, the narrator of the events, and Armie Hammer as John Reid, the Lone Ranger. The story tells through Tonto's memories of the duo's earliest efforts to subdue local villainy and bring justice to the American Old West. William Fichtner, Barry Pepper, Ruth Wilson, James Badge Dale, Tom Wilkinson and Helena Bonham Carter are featured in supporting roles. This was the first theatrical film featuring the Lone Ranger and Tonto characters since William A. Fraker's 1981 film, The Legend of the Lone Ranger.",
    "year": "2013",
    "filmingLocations": "Colorado, Black Hawk",
    "imdbUrl": "https://www.imdb.com/title/tt1210819/"
  },
  {
    "title": "Lone Star (1952 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTk1NWZmMjItNjJhMy00ZjAzLTg5Y2ItY2IwYmY3MGRhMjlkXkEyXkFqcGc@._V1_.jpg",
    "description": "Lone Star is a 1952 American Western film starring Clark Gable, Ava Gardner, Broderick Crawford, Ed Begley, and Lionel Barrymore as President Andrew Jackson. The film also marks the first (uncredited) screen appearance by then-13-year-old George Hamilton, playing beside Barrymore in the role of Jackson's servant.",
    "year": "1952",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0116905/"
  },
  {
    "title": "Lucky Luke (1991 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNjlkNjljN2YtNmY0NS00YjVlLWJmNjYtNDljNGRmNWFkNGUyXkEyXkFqcGc@._V1_.jpg",
    "description": "Lucky Luke is a 1991 Italian-American Western comedy film directed by and starring Terence Hill and based on the Belgian comic book of the same name. It is also the pilot episode of the Lucky Luke television series.",
    "year": "1991",
    "filmingLocations": "Pueblo, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0102351/"
  },
  {
    "title": "The Misled Romance of Cannibal Girl & Incest Boy",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNTdlYWUxOTgtMWQzNi00ZjBjLWFiZDgtNWU0N2IwOTBmMTAyXkEyXkFqcGc@._V1_.jpg",
    "description": "The Misled Romance of Cannibal Girl & Incest Boy is a 2007 independent short horror film directed by Richard Taylor and produced by the Denver, Colorado-based production company, Bizjack Flemco.",
    "year": "2007",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt1127701/"
  },
  {
    "title": "Miss Arizona (1919 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTA2MDZhNmEtY2JiZC00ZDllLThhYjctNjdiOWNlMmRkMWIyXkEyXkFqcGc@._V1_.jpg",
    "description": "Miss Arizona is a 1919 western silent film directed by Otis B. Thayer and starring Gertrude Bondhill and James O'Neill. The film was shot in Englewood, Colorado by Thayer's Art-O-Graf film company. There is at least one known 35mm nitro copy of this film stored at Filmarchiv Austria.",
    "year": "1919",
    "filmingLocations": "Pikes Peak, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt7356166/"
  },
  {
    "title": "Mountain Family Robinson",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZmFlODNkMGUtNDM4OC00NTRiLTkzNjYtZTI3ZDc0NzExY2FmXkEyXkFqcGc@._V1_.jpg",
    "description": "Mountain Family Robinson is a 1979 family movie that stars Robert Logan, Susan Damante-Shaw and George Buck Flower. This film is a sequel to The Adventures of the Wilderness Family and The Further Adventures of the Wilderness Family and, like its predecessors, was filmed in the states of Colorado and Utah.",
    "year": "1979",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0079580/"
  },
  {
    "title": "National Lampoon's Christmas Vacation",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDgxYzI2YWItNmUyNS00ZWE4LWEzZDctYTk1M2VkYjhkOWVmXkEyXkFqcGc@._V1_.jpg",
    "description": "National Lampoon's Christmas Vacation is a 1989 American Christmas slapstick comedy film and the third installment in National Lampoon magazine's Vacation film series. Christmas Vacation was directed by Jeremiah S. Chechik, written and co-produced by John Hughes, and starring Chevy Chase, Beverly D'Angelo, and Randy Quaid, and it also featured Mae Questel's final film role before her death in 1998.",
    "year": "1989",
    "filmingLocations": "Breckenridge, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0097958/"
  },
  {
    "title": "National Lampoon's Vacation",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOWQ3ZTg3MzYtOGU0Yi00NjgyLWFkNmMtMWFlZWE3MTkyOTdlXkEyXkFqcGc@._V1_.jpg",
    "description": "National Lampoon's Vacation, sometimes referred to as simply Vacation, is a 1983 American comedy road film directed by Harold Ramis and starring Chevy Chase, Beverly D'Angelo, Imogene Coca, Randy Quaid, John Candy, and Christie Brinkley in her acting debut with special appearances by Eddie Bracken, Brian Doyle-Murray, Miriam Flynn, James Keach, Eugene Levy, and Frank McRae. It tells the fictitious story of the Griswold family on a cross-country trip to an amusement park and various locations as accidents occur along the way. The screenplay was written by John Hughes on the basis of his short story \"Vacation '58\", which appeared in National Lampoon.",
    "year": "1983",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0085995/"
  },
  {
    "title": "The New Adventures of Heidi",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTgzMTE5OTcyM15BMl5BanBnXkFtZTcwNTk5MDAzMQ@@._V1_.jpg",
    "description": "The New Adventures of Heidi is a 1978 American made-for-television musical comedy-drama film updating the Heidi character to the present time and shifting the action from Switzerland to New York City. The film was released theatrically in Spain and Australia. Charles B. Fitzsimons had the idea to turn the film into a musical with comedy writer Buz Kohan writing ten songs for the film, sung by the stars Katy Kurtzman, Burl Ives, John Gavin and Marlyn Mason who played Heidi on stage in 1954 at the Player's Ring Theatre in Hollywood.",
    "year": "1978",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0077984/"
  },
  {
    "title": "Nurse Betty",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNmUwNWEwODEtOGYwNi00YzE4LTk3NjMtMGFjZDliMTliNmM4XkEyXkFqcGc@._V1_.jpg",
    "description": "Nurse Betty is a 2000 American black comedy film directed by Neil LaBute and starring Renée Zellweger as the title character, a small town, Kansas waitress who suffers a nervous breakdown after witnessing her husband's torture murder, and starts obsessively pursuing her favorite television soap opera character, while in a fugue state. Morgan Freeman and Chris Rock play the hitmen who killed her husband and subsequently pursue her to Los Angeles.",
    "year": "2000",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0171580/"
  },
  {
    "title": "On Dangerous Ground",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMzI5MWVkOWEtYTU3ZS00YzNmLTg1ZDctOGY0MWZhYzU5ZDA0XkEyXkFqcGc@._V1_.jpg",
    "description": "On Dangerous Ground is a 1951 film noir directed by Nicholas Ray, starring Robert Ryan and Ida Lupino, and produced by John Houseman. The screenplay was written by A. I. Bezzerides based on the 1945 novel Mad with Much Heart by Gerald Butler.",
    "year": "1951",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0043879/"
  },
  {
    "title": "One Minute to Zero",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTY4ZjJiZjYtNWVmNS00MTAyLWJhYTQtMzBjNGI3ZWE1NmIxXkEyXkFqcGc@._V1_.jpg",
    "description": "One Minute to Zero is a 1952 American romantic war film starring Robert Mitchum and Ann Blyth, set during the opening phases of the Korean War, and produced by Howard Hughes as his last film as producer. Victor Young's score for the film includes the first appearance of \"When I Fall in Love\", as the instrumental titled \"Theme from One Minute to Zero\". The film showcases the contributions of the U.S. Army and U.S. Air Force, the South Korean Army, the United Nations, the British Army and the Royal Australian Air Force during the early days of the Korean War. The effects of air power in the Korean War were also vividly depicted through the use of combat footage.",
    "year": "1952",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0044997/"
  },
  {
    "title": "One on One (1977 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZmFiMDM5ZDgtZGFlZS00NjhjLWExNmQtNzViZWIyMDA3ZmFhXkEyXkFqcGc@._V1_.jpg",
    "description": "One on One is a 1977 American sports drama film starring Robby Benson and Annette O'Toole. It was written by Benson and his father Jerry Segal. It was directed by Lamont Johnson and features a soundtrack performed by Seals and Crofts.",
    "year": "1977",
    "filmingLocations": "Fort Collins, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0284770/"
  },
  {
    "title": "Our Souls at Night",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMzU4ODQ5MDc5OV5BMl5BanBnXkFtZTgwMjk4MDM1MzI@._V1_.jpg",
    "description": "Our Souls at Night is a 2017 American romantic drama film directed by Ritesh Batra from a screenplay by Scott Neustadter and Michael H. Weber, based on the 2015 novel by Kent Haruf. The film stars Robert Redford, Jane Fonda, Matthias Schoenaerts, and Judy Greer. It marked the final collaboration between Fonda and Redford, who had previously co-starred in The Chase, Barefoot in the Park, and The Electric Horseman.",
    "year": "2017",
    "filmingLocations": "Denver, Colorado Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt5034266/"
  },
  {
    "title": "Out of the Depths (1921 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNmZjZjNhNmMtODg2NS00NmM4LWIzNzUtMTFhMzhmMGUyZDA4XkEyXkFqcGc@._V1_.jpg",
    "description": "Out of the Depths is a 1921 American silent Western film based on a book by Robert Ames Bennet and directed by Otis B. Thayer and Frank Reicher, starring Edmund Cobb and Violet Mersereau. The film was shot in Denver, Colorado by Thayer's Art-O-Graf film company. It is now considered a lost film.",
    "year": "1921",
    "filmingLocations": "Denver, Pikes Peak, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt5457670/"
  },
  {
    "title": "Over the Edge (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjc5Y2RmOTAtYTM3ZS00N2E1LTliYjEtOWNmYWRjNWVkYjkwXkEyXkFqcGc@._V1_.jpg",
    "description": "Over the Edge is a 1979 American coming-of-age film directed by Jonathan Kaplan and released in May 1979. The film, based on actual events, had a limited theatrical release but has since achieved cult film status. It was Matt Dillon's film debut.",
    "year": "1979",
    "filmingLocations": "Denver, Aurora, Greeley, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0079688/"
  },
  {
    "title": "P.K. and the Kid",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOGE2MjczYTEtYmIxNi00NmUzLTk4NDEtMGRlNzVlNThjYWE3XkEyXkFqcGc@._V1_.jpg",
    "description": "P.K. and the Kid is a 1987 American drama film directed by Lou Lombardo and starring Paul Le Mat, Molly Ringwald, Alex Rocco, Charles Hallahan and Fionnula Flanagan. Filmed in 1983 but shelved for four years, it was eventually released in 1987.",
    "year": "1987",
    "filmingLocations": "Colorado, Glenwood Springs",
    "imdbUrl": "https://www.imdb.com/title/tt0084460/"
  },
  {
    "title": "Pat and Mike",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BODEzNGM2OGMtMzhlNC00YzRlLWI3ZTMtYmMxOGRlY2UxOTc5XkEyXkFqcGc@._V1_.jpg",
    "description": "Pat and Mike is a 1952 American romantic comedy film starring Spencer Tracy and Katharine Hepburn. The movie was written by Ruth Gordon and Garson Kanin, and directed by George Cukor. Cukor directed The Philadelphia Story (1940) with Hepburn, and Cukor, Gordon and Kanin teamed with Hepburn and Tracy again for Adam's Rib (1949). Gordon and Kanin were nominated for the 1952 Academy Award for Best Original Screenplay for their work on Pat and Mike.",
    "year": "1952",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0045012/"
  },
  {
    "title": "Phantoms (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYzA0NjY2OTEtMGNiZS00NDFiLWI2M2UtY2ExMzNmNTAzYzU4XkEyXkFqcGc@._V1_.jpg",
    "description": "Phantoms is a 1998 American science fiction and supernatural horror film directed by Joe Chappelle and starring Peter O'Toole, Rose McGowan, Joanna Going, Liev Schreiber, Ben Affleck, Nicky Katt, and Clifton Powell. The screenplay was adapted by Dean Koontz from his own 1983 novel of the same name. The film takes place in the peaceful town of Snowfield, Colorado, where something evil has wiped out the community. It is up to a group of people to stop it or at least get out of Snowfield alive. While Koontz's novel included many literary references to the work of H. P. Lovecraft, these are largely absent from the film.",
    "year": "1998",
    "filmingLocations": "Colorado, Georgetown, Buena Vista",
    "imdbUrl": "https://www.imdb.com/title/tt0119891/"
  },
  {
    "title": "The Philadelphia Experiment (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNjM0MmFiZGQtNjU4ZS00NWQwLTliZDEtZThjNjljNmI1MTIzXkEyXkFqcGc@._V1_.jpg",
    "description": "The Philadelphia Experiment is a 1984 American science fiction film. It is directed by Stewart Raffill, stars Michael Paré, Bobby Di Cicco, Kene Holliday and Nancy Allen and is based on the urban legend of the Philadelphia Experiment. In 1943, United States Navy sailors David Herdeg (Paré) and Jim Parker are thrown forward in time to the year 1984 when a scientific experiment being performed aboard the USS Eldridge suffers a catastrophe. The film follows the two men as they attempt to survive the future and race against time to put an end to the experiment that now threatens the fate of the entire world.",
    "year": "1984",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0087910/"
  },
  {
    "title": "The Prestige (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTM3MzQ5MjQ5OF5BMl5BanBnXkFtZTcwMTQ3NzMzMw@@._V1_.jpg",
    "description": "The Prestige is a 2006 science fiction psychological thriller film directed by Christopher Nolan, who co-wrote the screenplay with Jonathan Nolan and is based on the 1995 novel by Christopher Priest. It stars Hugh Jackman as Robert Angier and Christian Bale as Alfred Borden, rival stage magicians in Victorian London who feud over a perfect teleportation illusion.",
    "year": "2006",
    "filmingLocations": "Colorado Springs, Colorado, Buena Vista",
    "imdbUrl": "https://www.imdb.com/title/tt0482571/"
  },
  {
    "title": "The Rain People",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNTZiZWFlN2YtOTNhYy00OWVjLTgwZDEtY2M2ZGI5ZWVkMDYxXkEyXkFqcGc@._V1_.jpg",
    "description": "The Rain People is a 1969 American road drama film written and directed by Francis Ford Coppola, and starring Shirley Knight, James Caan and Robert Duvall. The film centers on a middle-class housewife (Knight), who runs away from her husband after learning she is pregnant.",
    "year": "1969",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0064873/"
  },
  {
    "title": "The Razor's Edge (1946 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYzAzYTBlYWMtMTRjYi00NWIwLThhY2QtM2VmYTYyNzc3NjRmXkEyXkFqcGc@._V1_.jpg",
    "description": "The Razor's Edge is a 1946 American drama film based on W. Somerset Maugham's 1944 novel of the same name. It stars Tyrone Power, Gene Tierney, John Payne, Anne Baxter, Clifton Webb, and Herbert Marshall, with a supporting cast including Lucile Watson, Frank Latimore, and Elsa Lanchester. Marshall plays Somerset Maugham. The film was directed by Edmund Goulding.",
    "year": "1946",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0087980/"
  },
  {
    "title": "Rent-A-Pal",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDNiODQ3ZjAtMGU2OS00Yjk3LWJlMjEtNjEwYjA3ZWFjNTMzXkEyXkFqcGc@._V1_.jpg",
    "description": "Rent-A-Pal is a 2020 American thriller film written and directed by Jon Stevenson, produced by Brian Landis Folkins, Jon Stevenson, Annie Elizabeth Baker, Jimmy Weber, Robert B. Martin Jr. and Brandon Fryman. It stars Wil Wheaton, Brian Landis Folkins, Kathleen Brady, Amy Rutledge, and Adrian Egolf.",
    "year": "2020",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt12274228/"
  },
  {
    "title": "Riders of the Range (1923 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNGVjZjc1M2MtNjg2NS00NTUzLWFhNDMtNzk3N2JmM2RiMjBkXkEyXkFqcGc@._V1_.jpg",
    "description": "Riders of the Range is a 1923 American silent Western film presented by Clifford S. Efelt, directed by Otis B. Thayer, and starring Edmund Cobb, Dolly Dale, Helen Hayes and Frank Gallagher. The film was shot in Colorado by Thayer's Art-O-Graf film company. It was a Roy M. Langdon Production. The film was released on VHS by Grapevine Video.",
    "year": "1923",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0042892/"
  },
  {
    "title": "Runaway! (1973 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BM2NmZmRiZjUtOTQyMy00YmY5LThlOGItYzQyNGU0ZjQzNmEyXkEyXkFqcGc@._V1_.jpg",
    "description": "Runaway! is a 1973 American made-for-television thriller film directed by David Lowell Rich. It is an action thriller involving skiers trapped on a runaway train speeding down a mountain. The film was produced by Universal and originally aired on ABC on September 29, 1973. It was re-titled The Runaway Train when released theatrically abroad.",
    "year": "1973",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0070615/"
  },
  {
    "title": "Scarecrow (1973 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BY2Q4ODA2MGUtMDVmNi00YzQzLWIzY2ItOTQ1NzEyMDZkNTQ4XkEyXkFqcGc@._V1_.jpg",
    "description": "Scarecrow is a 1973 American road comedy-drama film directed by Jerry Schatzberg and starring Gene Hackman and Al Pacino. The story involves the relationship between two men who travel from California seeking to start a business in Pittsburgh.",
    "year": "1973",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt0070643/"
  },
  {
    "title": "The Scarlet West",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjY0ZThkMDYtMTNmOC00Mzg0LTlhZDYtYTc1YTBmNGQ1YTVjXkEyXkFqcGc@._V1_.jpg",
    "description": "The Scarlet West is a 1925 American silent historical drama film directed by John G. Adolfi and starring Robert Frazer and Clara Bow. It was distributed by the First National company.",
    "year": "1925",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0016320/"
  },
  {
    "title": "The Searchers",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTQ4YWI0MTItMTE4YS00ZTNjLWE3ZTQtN2E2MTlhYWQxNDNmXkEyXkFqcGc@._V1_.jpg",
    "description": "The Searchers is a 1956 American epic Western film directed by John Ford and written by Frank S. Nugent, based on the 1954 novel by Alan Le May. It is set during the Texas–Indian wars, and stars John Wayne as a middle-aged Civil War veteran who, accompanied by his adopted nephew, spends years looking for his abducted niece. It was shot in VistaVision on Eastmancolor negative with processing and prints by Technicolor.",
    "year": "1956",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt0049730/"
  },
  {
    "title": "The Secret of Convict Lake",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTFjZjg5ZWEtZDA3Zi00MjBlLTgyODctNDdhNTcwZTM4MzY3XkEyXkFqcGc@._V1_.jpg",
    "description": "The Secret of Convict Lake is a 1951 American Western film directed by Michael Gordon and starring Glenn Ford, Gene Tierney, Ethel Barrymore and Zachary Scott. The film was a critical and commercial success. The story is fiction, based on legends of Convict Lake, located in the Sierra Nevada mountain ranges of northern California. and a short story by Anna Hunger and Jack Pollexfen. The film is the final role for Ann Dvorak before her retirement from the screen.",
    "year": "1951",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0044015/"
  },
  {
    "title": "The Shining (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNmM5ZThhY2ItOGRjOS00NzZiLWEwYTItNDgyMjFkOTgxMmRiXkEyXkFqcGc@._V1_.jpg",
    "description": "The Shining is a 1980 psychological horror film produced and directed by Stanley Kubrick and co-written with novelist Diane Johnson. The film is based on Stephen King's 1977 novel of the same name and stars Jack Nicholson, Shelley Duvall, Scatman Crothers, and Danny Lloyd. The film's central character is Jack Torrance (Nicholson), an aspiring writer and recovering alcoholic who accepts a position as the off-season caretaker of the isolated historic Overlook Hotel in the Colorado Rockies. Exterior scenes were shot at Timberline Lodge on Mount Hood in Oregon, while the Stanley Hotel in Estes Park, Colorado was the inspiration for the fictional Overlook Hotel.",
    "year": "1980",
    "filmingLocations": "Estes Park, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0081505/"
  },
  {
    "title": "Siege at Red River",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDgzZjlmNTUtNDExNC00Yjg3LTlhZDYtOGJiODNhNDI5MzdiXkEyXkFqcGc@._V1_.jpg",
    "description": "Siege at Red River is a 1954 American Western film directed by Rudolph Maté and written by Sydney Boehm. The film stars Van Johnson, Joanne Dru, Richard Boone, Milburn Stone, Jeff Morrow, and Craig Hill. The film was released on May 1, 1954, by 20th Century Fox.",
    "year": "1954",
    "filmingLocations": "Durango, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0047488/"
  },
  {
    "title": "Silver City (2004 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTk3NzA2MTIzNF5BMl5BanBnXkFtZTYwMzcwMjM3._V1_.jpg",
    "description": "Silver City is a 2004 American political satire comedy-drama film written and directed by John Sayles. Chris Cooper portrays an inept Republican gubernatorial candidate, a character that was noted for similarities to U.S. President George W. Bush. The film's large ensemble cast includes, among others, Richard Dreyfuss, Danny Huston, Michael Murphy, Maria Bello, Kris Kristofferson, Mary Kay Place, Thora Birch, Tim Roth, Billy Zane and Daryl Hannah.",
    "year": "2004",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0376890/"
  },
  {
    "title": "Sleeper (1973 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZGVhZWIwZTQtZGVjMS00MzZkLWEzNWMtMDVmNDU5NmRmNTY1XkEyXkFqcGc@._V1_.jpg",
    "description": "Sleeper is a 1973 American science fiction comedy film directed by and starring Woody Allen, who co-wrote it with Marshall Brickman. Parodying a dystopic future of the United States in 2173, the film involves the misadventures of the owner of a health food store who is cryogenically frozen in 1973 and defrosted 200 years later in an ineptly led police state. Contemporary politics and pop culture are satirized throughout the film, which includes tributes to the classic comedy of Buster Keaton, Harold Lloyd, and Charlie Chaplin. Many elements of notable works of science fiction are also paid tribute to, or parodied.",
    "year": "1973",
    "filmingLocations": "Denver, Boulder, Lakewood, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0070707/"
  },
  {
    "title": "Snowbeast",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOGQ0MTkwOGYtOTFlNy00NzFmLTg2MDktZTA2YjdjODQ0NTNjXkEyXkFqcGc@._V1_.jpg",
    "description": "Snowbeast is a 1977 American made-for-television horror film starring Bo Svenson, Yvette Mimieux, Robert Logan and Clint Walker, and follows the story of a bloodthirsty Bigfoot-like monster terrorizing a ski resort in the Colorado Rockies. It was directed by Herb Wallerstein from a teleplay written by Joseph Stefano. The film originally premiered as the NBC Thursday Night Movie on NBC on April 28, 1977.",
    "year": "1977",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0076731/"
  },
  {
    "title": "The Sons of Katie Elder",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTBiMDI3ZDUtYzBjMi00NWMyLTk2NmEtZWM2NmIwMGI4Yjk4XkEyXkFqcGc@._V1_.jpg",
    "description": "The Sons of Katie Elder is a 1965 American Western film in Panavision, directed by Henry Hathaway and starring John Wayne and Dean Martin. It was filmed principally in Mexico.",
    "year": "1965",
    "filmingLocations": "Denver, Durango, Colorado, Leadville",
    "imdbUrl": "https://www.imdb.com/title/tt0059740/"
  },
  {
    "title": "Stagecoach (1966 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZmQ5ZGIyMjYtMjczYy00N2EzLWE3ZjMtNmI4ZDc3MDVmOWEwXkEyXkFqcGc@._V1_.jpg",
    "description": "Stagecoach is a 1966 American Western film, directed by Gordon Douglas between July and September 1965, as a color remake of the Academy Award-winning John Ford 1939 classic black-and-white western Stagecoach. Unlike the original version which listed its ten leading players in order of importance, the major stars are billed in alphabetical order.",
    "year": "1966",
    "filmingLocations": "Boulder, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0031971/"
  },
  {
    "title": "Stand Up and Be Counted",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNDRkZjczZmItZGU3Zi00NjVmLThjY2YtNjgxYTA0OTVmMmU2XkEyXkFqcGc@._V1_.jpg",
    "description": "Stand Up and Be Counted is a 1972 American comedy film directed by Jackie Cooper and starring Jacqueline Bisset and Stella Stevens. It features the recording of \"I Am Woman\" (1971) by Helen Reddy.",
    "year": "1972",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0069307/"
  },
  {
    "title": "Star Raiders: The Adventures of Saber Raine",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNDQyNTQyNzkxNl5BMl5BanBnXkFtZTgwMTU4NTkyNzE@._V1_.jpg",
    "description": "Star Raiders: The Adventures of Saber Raine is a 2017 American science fiction film about a group of mercenaries who embark on a mission to rescue a prince and princess from an evil tyrant on a far away planet. It was directed by Mark Steven Grove, and stars Casper Van Dien, Cynthia Rothrock, James Lew, Brit Laree, Sara N. Salazar and Sarah Sansoni.",
    "year": "2017",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt2039380/"
  },
  {
    "title": "Starman (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMzBjMGFjMGItOTVhMC00NTJiLWIyY2MtYThkYWFkMWI2MGM4XkEyXkFqcGc@._V1_.jpg",
    "description": "Starman is a 1984 American science fiction romance drama film directed by John Carpenter and written by Bruce A. Evans and Raynold Gideon, with Dean Riesner making uncredited rewrites. It tells the story of a relationship between recently widowed Jenny Hayden and Starman, a non-corporeal alien who has come to Earth and cloned the human body of her deceased husband Scott, in response to the invitation found on the gold phonograph record installed on the Voyager 2 space probe.",
    "year": "1984",
    "filmingLocations": null,
    "imdbUrl": "https://www.imdb.com/title/tt0088172/"
  },
  {
    "title": "Switchback (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMjZlYTBjYjEtMDVmMS00NGY2LTllZmQtZWYxZDM3Y2M1YjRjXkEyXkFqcGc@._V1_.jpg",
    "description": "Switchback is a 1997 American crime thriller film written and directed by Jeb Stuart in his directorial debut. It stars Dennis Quaid, Danny Glover, Jared Leto, Ted Levine, William Fichtner and R. Lee Ermey. An FBI agent tracks his son's kidnapper to Amarillo, Texas, where two lawmen are seeking to use the case in their election bid.",
    "year": "1997",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0119210/"
  },
  {
    "title": "Takkari Donga",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNzllZTlkMDAtM2M2OS00MjdmLTllMTUtMjU2YWRhZTMwN2YyXkEyXkFqcGc@._V1_.jpg",
    "description": "Takkari Donga is a 2002 Indian Telugu-language Western film directed and produced by Jayanth C. Paranjee. The film stars Mahesh Babu, Lisa Ray, Bipasha Basu, and Rahul Dev in pivotal roles. The film follows a fearless outlaw who offers to safeguard the daughter of his accomplice in return for a map to a secret diamond mine. However, his quest is compromised after a bandit gets wind of the secret map.",
    "year": "2002",
    "filmingLocations": "Monument Valley and Arches National Park",
    "imdbUrl": "https://www.imdb.com/title/tt0307541/"
  },
  {
    "title": "Tall Tale (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZTJjYWZlOTMtNTZiZC00MmVmLTg3NzMtODFkMDZhNWExMzA0XkEyXkFqcGc@._V1_.jpg",
    "description": "Tall Tale is a 1995 American Western adventure fantasy film directed by Jeremiah Chechik, written by Steven L. Bloom and Robert Rodat, produced by Walt Disney Pictures and Caravan Pictures and starring Scott Glenn, Oliver Platt, Nick Stahl, Stephen Lang, Roger Aaron Brown, Catherine O'Hara, and Patrick Swayze. It tells the story of a young farm boy who receives aid from tall tale figures in saving his town from a greedy developer.",
    "year": "1995",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0111359/"
  },
  {
    "title": "Things to Do in Denver When You're Dead",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMDEzMzQ0YTctYTg0Ny00Y2MxLWE1ZjAtNzQwMjVmNWQxZTIwXkEyXkFqcGc@._V1_.jpg",
    "description": "Things to Do in Denver When You're Dead is a 1995 American crime drama film directed by Gary Fleder and written by Scott Rosenberg. The film features an ensemble cast that includes Andy García, Christopher Lloyd, Treat Williams, Steve Buscemi, Christopher Walken, Fairuza Balk, and Gabrielle Anwar.",
    "year": "1995",
    "filmingLocations": "Denver, Buena Vista",
    "imdbUrl": "https://www.imdb.com/title/tt0114660/"
  },
  {
    "title": "Throttle (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNDBlMmM0ZmItYjJkYi00OTVmLTkwNWQtOTQ3NWViMzdkYWFlXkEyXkFqcGc@._V1_.jpg",
    "description": "Throttle is a 2005 American thriller film and a spinoff sequel to Duel (1971). It was directed by James Seale and starring Grayson McCouch. Other cast members include Adrian Paul and Amy Locane. It was filmed entirely in Denver, Colorado.",
    "year": "2005",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0398033/"
  },
  {
    "title": "A Ticket to Tomahawk",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BY2JlMWUxMzQtN2EyYi00YmQ0LWJhMzgtNGM1MTAzNGIxODJkXkEyXkFqcGc@._V1_.jpg",
    "description": "A Ticket to Tomahawk is a 1950 American Western film directed by Richard Sale and starring Dan Dailey and Anne Baxter. It was released by 20th Century Fox. Marilyn Monroe appears in one of her earliest roles.",
    "year": "1950",
    "filmingLocations": "Denver, Boulder, Durango, Colorado, Silverton",
    "imdbUrl": "https://www.imdb.com/title/tt0043046/"
  },
  {
    "title": "Tracked by Bloodhounds; or, A Lynching at Cripple Creek",
    "imageUrl": "https://m.media-amazon.com/images/G/01/imdb/images/social/imdb_logo.png",
    "description": "Tracked by Bloodhounds; or, A Lynching at Cripple Creek is a 1904 silent crime drama short film directed by Harry Buckwalter.",
    "year": "1904",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0232834/"
  },
  {
    "title": "The Trail of '98",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTY2ODAyOTgyOV5BMl5BanBnXkFtZTgwODk1NTQzMjE@._V1_.jpg",
    "description": "The Trail of '98 is a 1928 American synchronized sound action-adventure/drama film featuring Harry Carey and Dolores del Río about the Klondike Gold Rush. While the film has no audible dialog, it was released with a synchronized musical score, with sound effects using both the sound-on-disc and sound-on-film process. The film was originally released by Metro-Goldwyn-Mayer in a short-lived widescreen process called \"Fantom Screen\". The film is based on the 1910 novel of the same name, written by Robert W. Service.",
    "year": "1928",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0019489/"
  },
  {
    "title": "True Grit (1969 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDM0NjllNDEtYjIzZS00MDZjLWE1NzYtYWEwNGM3NjEwNmVmXkEyXkFqcGc@._V1_.jpg",
    "description": "True Grit is a 1969 American Western film directed by Henry Hathaway and produced by Hal B. Wallis. Starring John Wayne as U.S. Marshal Rooster Cogburn, with Glen Campbell and Kim Darby, the film is adapted by Marguerite Roberts from Charles Portis' 1968 novel of the same name.",
    "year": "1969",
    "filmingLocations": "Colorado, Ouray, Montrose",
    "imdbUrl": "https://www.imdb.com/title/tt0065126/"
  },
  {
    "title": "Under Siege 2: Dark Territory",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BN2YwOGZiYmUtZjUxMy00YWE5LWEwOGMtYmVjM2QyODFkN2I1XkEyXkFqcGc@._V1_.jpg",
    "description": "Under Siege 2: Dark Territory is a 1995 American action thriller film directed by Geoff Murphy, starring Steven Seagal as the ex-Navy SEAL, Casey Ryback. Set on board a train traveling through the Rocky Mountains from Denver to Los Angeles, it is the sequel to the 1992 film Under Siege also starring Seagal. The title refers to the railroading term that the subject train was travelling through dark territory, a section of railroad track that has no train signals and in which communications between train dispatchers and the railroad engineers were impossible.",
    "year": "1995",
    "filmingLocations": "Denver",
    "imdbUrl": "https://www.imdb.com/title/tt0114781/"
  },
  {
    "title": "Unglassed Windows Cast a Terrible Reflection",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZmIxMTg4YWYtYTQwZi00NTM4LTgyMTYtMjA0ZDEwMDk2ZTkwXkEyXkFqcGc@._V1_.jpg",
    "description": "Unglassed Windows Cast a Terrible Reflection is a 1953 American short film directed by Stan Brakhage. Shot while in Brakhage's native Denver, the film stars Larry Jordan who later went on to become a film director. Filming was done in Nevadaville, Colorado. Like his other films at the time, it was shot on 16mm film, is black and white and features no dialogue.",
    "year": "1953",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0351920/"
  },
  {
    "title": "The Unsinkable Molly Brown (film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BYmVkYzUzNTEtMDNhNC00MjQxLTliYWQtODYyYzNjNzg2OGMyXkEyXkFqcGc@._V1_.jpg",
    "description": "The Unsinkable Molly Brown is a 1964 American Western musical comedy film directed by Charles Walters and starring Debbie Reynolds, filmed in Panavision. The screenplay by Helen Deutsch is based on the book of the 1960 musical of the same name by Richard Morris. The song score was composed by Meredith Willson. The plot is a fictionalized account of the life of Margaret Brown, who survived the 1912 sinking of the RMS Titanic. Reynolds was nominated for the Academy Award for Best Actress for her portrayal of Brown.",
    "year": "1964",
    "filmingLocations": "Denver, Colorado, Leadville",
    "imdbUrl": "https://www.imdb.com/title/tt0058708/"
  },
  {
    "title": "Vanishing Point (1971 film)",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOWE1MDBiZjYtYjE5Ny00MGUxLWJhMTEtYTM5MjcyZjYzN2Q0XkEyXkFqcGc@._V1_.jpg",
    "description": "Vanishing Point is a 1971 American action film directed by Richard C. Sarafian, starring Barry Newman, Cleavon Little, and Dean Jagger. It focuses on a disaffected ex-policeman and race car driver delivering a muscle car cross-country to California while high on speed, being chased by police, and meeting various characters along the way. Since its release it has developed a cult following.",
    "year": "1971",
    "filmingLocations": "Denver, Thornton, Colorado, Glenwood Springs",
    "imdbUrl": "https://www.imdb.com/title/tt0067927/"
  },
  {
    "title": "Vengeance Valley",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMzQwMzAzMTctMDM3Ny00ZjMzLTkzY2UtZTZjOWNmZTZjZWNjXkEyXkFqcGc@._V1_.jpg",
    "description": "Vengeance Valley is a 1951 American Technicolor Western film directed by Richard Thorpe and starring Burt Lancaster, with a supporting cast featuring Robert Walker, Joanne Dru, Sally Forrest, John Ireland and Ray Collins. It is based on the novel by Luke Short. In 1979, the film entered the public domain in the United States because Metro-Goldwyn-Mayer did not renew its copyright registration in the 28th year after publication.",
    "year": "1951",
    "filmingLocations": "Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0044186/"
  },
  {
    "title": "Viva Zapata!",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMDkxM2NkNDMtMTk5OS00N2UzLWJiZWUtZmRjZDJjMGMzZWU3XkEyXkFqcGc@._V1_.jpg",
    "description": "Viva Zapata! is a 1952 American biographical Western film directed by Elia Kazan, dramatizing the life of Mexican revolutionary Emiliano Zapata from his peasant upbringing through his rise to power in the early 1900s and his death in 1919. It stars Marlon Brando as the title character, and features Jean Peters as his wife Josefa and Anthony Quinn as his brother Eufemio. The screenplay was written by John Steinbeck, using Edgcumb Pinchon's 1941 book Zapata the Unconquerable as a guide.",
    "year": "1952",
    "filmingLocations": "Durango, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0045296/"
  },
  {
    "title": "WarGames",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMmM5MDlmZWUtYTE1Mi00M2JiLTk1NzYtMTg0NTdlMzM2N2RkXkEyXkFqcGc@._V1_.jpg",
    "description": "WarGames is a 1983 American techno-thriller film directed by John Badham, written by Lawrence Lasker and Walter F. Parkes, and starring Matthew Broderick, Dabney Coleman, John Wood and Ally Sheedy. Broderick plays David Lightman, a young computer hacker who unwittingly accesses a United States military supercomputer programmed to simulate, predict and execute nuclear war against the Soviet Union, triggering a false alarm that threatens to start World War III. Martin Brest was originally the film's director, but was fired early into production.",
    "year": "1983",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0086567/"
  },
  {
    "title": "Winter in Vail",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BOTdhMjBmZDItZWEyYi00OWExLWFlZDktZjQ2ZmM5MzdjZGU4XkEyXkFqcGc@._V1_.jpg",
    "description": "Winter in Vail is a 2020 American made-for-television romance film directed by Terry Ingram, starring Lacey Chabert and Tyler Hynes.",
    "year": "2020",
    "filmingLocations": "Denver, Vail, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt11439610/"
  },
  {
    "title": "A Winter of Cyclists",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BMTk0NzE2MTU0NV5BMl5BanBnXkFtZTgwNDkyMzcwOTE@._V1_.jpg",
    "description": "A Winter of Cyclists is a 2013 documentary film by Mike Prendergast. The film chronicles a group of Colorado participants as they attempt to complete a 52-day winter bicycle commuting challenge created by Scot Stucky.",
    "year": "2013",
    "filmingLocations": "Denver, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt3127680/"
  },
  {
    "title": "Wolves of the Street",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZWZhOTAwYzQtNDUxOS00ODhjLWFkMWUtNjk0NzgyYWFlZGQ1XkEyXkFqcGc@._V1_.jpg",
    "description": "Wolves of the Street is a 1920 American silent drama film directed by Otis B. Thayer and starring Edmund Cobb and Vida Johnson. The film was shot in Steamboat Springs, Colorado by the Thayer's Art-O-Graf film company. Franklyn Farnum was originally cast for the lead role, but he did not appear in the completed film.",
    "year": "1920",
    "filmingLocations": "Denver, Steamboat Springs, Colorado",
    "imdbUrl": "https://www.imdb.com/title/tt0203209/"
  }
]